Revit 2024 API
BuiltInFailures.RoomFailures.OptionConflictRoomOverlapOption Property
 Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in Option '[Option Name]'.\nTo resolve, delete the duplicate Room or divide space with Room Separation Lines in the Main Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OptionConflictRoomOverlapOption { get; }
Visual Basic
Public Shared ReadOnly Property OptionConflictRoomOverlapOption As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OptionConflictRoomOverlapOption {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace